{
  "movies": [
    {
      "title": "Spider-Man: No Way Home 2021",
      "description": "With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.\nPeter Parker's secret identity is revealed to the entire world. Desperate for help, Peter turns to Doctor Strange to make the world forget that he is Spider-Man. The spell goes horribly wrong and shatters the multiverse, bringing in monstrous villains that could destroy the world.\nPicking up where Far From Home left off, Peter Parker's whole world is turned upside down when his old enemy Mysterio posthumously reveals his identity to the public. Wanting to make his identity a secret, Peter turns to Doctor Strange for help. But when Strange's spell goes haywire, Peter must go up against five deadly new enemies--the Green Goblin, Dr. Octopus, Electro, the Lizard and Sandman--all while discovering what it truly means to be Spider-Man.",
      "year": "2021",
      "genre": "action",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719932139/profilepicture/ueolmbqjavzanbzjywsj.jpg",
      "watched": false,
      "id": "bae9",
      "rating": 4
    },
    {
      "id": "f4d5",
      "title": "The GodFather",
      "description": "Don Vito Corleone, head of a mafia family, decides to hand over his empire to his youngest son, Michael. However, his decision unintentionally puts the lives of his loved ones in grave danger.",
      "year": "1972",
      "genre": "drama",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719982804/profilepicture/fsp6jhw2baa9iolgldqw.jpg",
      "watched": false,
      "rating": 3
    },
    {
      "title": "The Dark Knight",
      "description": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.\n\n",
      "year": "2008",
      "genre": "action",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719982911/profilepicture/du5bgjiksax0mbubdpkg.jpg",
      "watched": false,
      "id": "1e18"
    },
    {
      "id": "e9c9",
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "description": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.\n\n",
      "year": "2001",
      "genre": "action",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719983448/profilepicture/cxwzpvhjlxmmpqac4sae.jpg",
      "watched": false
    },
    {
      "id": "69a8",
      "title": "The Matrix",
      "description": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.\n\n",
      "year": "1999",
      "genre": "sci-fi",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719983635/profilepicture/shhqlrqkhxv9rcynrk7g.webp",
      "watched": false
    },
    {
      "id": "8e86",
      "title": "Inception",
      "description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.\n\n",
      "year": "2010",
      "genre": "sci-fi",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719983934/profilepicture/dovvzctv6jgupanpdvdr.jpg",
      "watched": false
    },
    {
      "id": "52e7",
      "title": "Interstellar",
      "description": "When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.\n\n",
      "year": "2014",
      "genre": "sci-fi",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719984520/profilepicture/tofx88v4dkm90npfbs0d.webp",
      "watched": false
    },
    {
      "id": "5bb4",
      "title": "The Green Mile",
      "description": "A tale set on death row, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the lead guard, Paul Edgecombe, recognizes John's gift, he tries to help stave off the condemned man's execution.\n\n",
      "year": "1999",
      "genre": "drama",
      "poster": "https://res.cloudinary.com/dzrerjvz2/image/upload/v1719984782/profilepicture/qzqsrl3oikz3kkk6xedn.jpg",
      "watched": false
    }
  ]
}